function [shapeq4,dhdrq4,dhdsq4]=feisoq4(r,s)

%------------------------------------------------------------------------
%     shapeq4 形函数
%     dhdrq4 形函数对r求偏导
%     dhdsq4 形函数对s求偏导
%     r为积分点横坐标  
%     s为积分点纵坐标
%------------------------------------------------------------------------

% 形函数

 shapeq4(1)=0.25*(1-r)*(1-s);
 shapeq4(2)=0.25*(1+r)*(1-s);
 shapeq4(3)=0.25*(1+r)*(1+s);
 shapeq4(4)=0.25*(1-r)*(1+s);

% 形函数对r求偏导

 dhdrq4(1)=-0.25*(1-s);
 dhdrq4(2)=0.25*(1-s);
 dhdrq4(3)=0.25*(1+s);
 dhdrq4(4)=-0.25*(1+s);
% 形函数对s求偏导
 dhdsq4(1)=-0.25*(1-r);
 dhdsq4(2)=-0.25*(1+r);
 dhdsq4(3)=0.25*(1+r);
 dhdsq4(4)=0.25*(1-r);
