clc;clear;
a=1; 
b=2;%设置积分区间
fun = @(x)log(x);%创建命名函数的函数句柄
prompt = '请输入高斯积分点数n： ';
gauss = input(prompt);%输入高斯点数，最大不超过5
    if gauss == 2%计算高斯点数为2时高斯积分的值
        x=[-1 1]/sqrt(3);%计算积分点
        wt=[1 1];%计算权重
        fprintf('***************************  2     points gauss  *******')
    elseif gauss == 3%计算高斯点数为3时高斯积分的值
        x = [-sqrt(3/5) 0 sqrt(3/5)];%计算积分点
        wt = [5 8 5]/9;%计算权重
        fprintf('***************************    3   points gauss  *******')
    elseif gauss == 4%计算高斯点数为4高斯积分的值
        fprintf('***************************    4   points gauss  *******')
        x = [   -sqrt((15+2*sqrt(30))/35),  -sqrt((15-2*sqrt(30))/35), ...
            sqrt((15-2*sqrt(30))/35),   sqrt((15+2*sqrt(30))/35)];%计算积分点
        wt = [  (90-5*sqrt(30))/180,    (90+5*sqrt(30))/180,...
            (90+5*sqrt(30))/180,    (90-5*sqrt(30))/180];%计算权重
    elseif gauss == 5%计算高斯点数为5时高斯积分的值
        fprintf('***************************    5    points gauss *******')
        x(1)=.906179845938664 ; x(2)=.538469310105683;
        x(3)=.0;      x(4)=-x(2) ; x(5)=-x(1);%计算积分点
        wt(1)=.236926885056189 ; wt(2)=.478628670499366;
        wt(3)=.568888888888889 ; wt(4)=wt(2) ; wt(5)=wt(1);%计算权重
    end
    %进行区间转变
    x = (b-a)/2*x+(b+a)/2;
    jac = (b-a)/2;
    f = fun(x);
    f = wt.* f .* jac;%计算相应积分点的积分值
    format long%保留16位有效数字
    value = sum(f)%计算高斯积分值
    exact = integral(fun,a,b)%使用matlab内置函数计算高斯积分
    fprintf('误差=%10.6e\n\n\n',norm(value-exact))%计算误差

