%% 简介
%{
作者：刘星宇
学号：202004061405
日期：2023.3.9
解决的问题：在0-100对sqrt(x)拟合
%}
%% 初始化
clc                           

x = 1:1:100;               %限定自变量取值范围
A=1+4+9+16+25+36+49+64;                   
B=1+2+3+4+5+6+7+8;
C=1+16+81+16*16+25*25+36*36+49*49+64*64;
D=1+8+27+4*16+5*25+6*36+7*49+8*64;        
                           %求解矩阵的相应系数

E=[8 A;
    A C];
d=[B;
    D];                    %给出两个相应矩阵

a= E\d                     %求解待求矩阵

a0=a(1);
a1=a(2);                   %给出一次拟合系数a0与a1

y = sqrt(x);
z = a0+a1*x;               %给出原函数与一次拟合函数表达式


plt1=plot(x,y);
hold on
plt2=plot(x,z);
hold on
title('一次拟合对比');
xlabel('自变量x');
ylabel('函数值y');

%以下求均方误差
e=(z-y).*(z-y);
plt3=plot(x,e);
legend([plt1,plt2,plt3],'原曲线','一次拟合曲线','误差函数');
