%***********************************************************************
%       8节点六面体单元主程序
%       姓名：叶梦影
%       学号：S230200221
%***********************************************************************
%此程序用于计算空间六面体单元的位移与载荷
clc,clear
F=-1000;
E=7e10;
NU=0.33;%自定义外力F=-1000N、弹性模量E=7e10、泊松比μ=0.33

%输入各个节点的坐标，此处共有24个节点
x1 = 0.2;y1 = 0;z1 = 0;
x2 = 0.2;y2 = 0;z2 = 0.2;
x3 = 0.2;y3 = 0;z3 = 0.4;
x4 = 0.2;y4 = 0.2;z4 = 0.4;
x5 = 0.2;y5 = 0.2;z5 = 0.2;
x6 = 0.2;y6 = 0.2;z6 = 0;
x7 = 0.2;y7 = 0.4;z7 = 0;
x8 = 0.2;y8 = 0.4;z8 = 0.2;
x9 = 0.2;y9 = 0.4;z9 = 0.4;
x10 = 0.2;y10 = 0.6;z10 = 0.4;
x11 = 0.2;y11 = 0.6;z11 = 0.2;
x12 = 0.2;y12 = 0.6;z12 = 0;
x13 = 0;y13 = 0.6;z13 = 0;
x14 = 0;y14 = 0.6;z14 = 0.2;
x15 = 0;y15 = 0.6;z15 = 0.4;
x16 = 0;y16 = 0.4;z16 = 0.4;
x17 = 0;y17 = 0.4;z17 = 0.2;
x18 = 0;y18 = 0.4;z18 = 0;
x19 = 0;y19 = 0.2;z19 = 0;
x20 = 0;y20 = 0.2;z20 = 0.2;
x21 = 0;y21= 0.2;z21 = 0.4;
x22 = 0;y22 = 0;z22 = 0.4;
x23 = 0;y23 = 0;z23 = 0.2;
x24 = 0;y24 = 0;z24 = 0;

%计算各单元的刚度矩阵，此处共有6个六面体单元
k1 = Hexahedral3D8Node_Stiffness(E,NU,x1,y1,z1,x6,y6,z6,x19,y19,z19,x24,y24,z24,x2,y2,z2,x5,y5,z5,x20,y20,z20,x23,y23,z23);
k2 = Hexahedral3D8Node_Stiffness(E,NU,x6,y6,z6,x7,y7,z7,x18,y18,z18,x19,y19,z19,x5,y5,z5,x8,y8,z8,x17,y17,z17,x20,y20,z20);
k3 = Hexahedral3D8Node_Stiffness(E,NU,x7,y7,z7,x12,y12,z12,x13,y13,z13,x18,y18,z18,x8,y8,z8,x11,y11,z11,x14,y14,z14,x17,y17,z17);
k4 = Hexahedral3D8Node_Stiffness(E,NU,x8,y8,z8,x11,y11,z11,x14,y14,z14,x17,y17,z17,x9,y9,z9,x10,y10,z10,x15,y15,z15,x16,y16,z16);
k5 = Hexahedral3D8Node_Stiffness(E,NU,x5,y5,z5,x8,y8,z8,x17,y17,z17,x20,y20,z20,x4,y4,z4,x9,y9,z9,x16,y16,z16,x21,y21,z21);
k6 = Hexahedral3D8Node_Stiffness(E,NU,x2,y2,z2,x5,y5,z5,x20,y20,z20,x23,y23,z23,x3,y3,z3,x4,y4,z4,x21,y21,z21,x22,y22,z22);

%组装整体的刚度矩阵
KK = zeros(72,72);    %新建一个72*72的零矩阵
KK = Hexahedral3D8Node_Assembly(KK,k1,1,6,19,24,2,5,20,23); 
KK = Hexahedral3D8Node_Assembly(KK,k2,6,7,18,19,5,8,17,20);
KK = Hexahedral3D8Node_Assembly(KK,k3,7,12,13,18,8,11,14,17);
KK = Hexahedral3D8Node_Assembly(KK,k4,8,11,14,17,9,10,15,16);
KK = Hexahedral3D8Node_Assembly(KK,k5,5,8,17,20,4,9,16,21);
KK = Hexahedral3D8Node_Assembly(KK,k6,2,5,20,23,3,4,21,22);


%高斯消去法删除刚度矩阵中固定约束处对应节点所对应的行和列
k=KK(10:63,10:63);

p = [0;0;0;0;0;0;0;0;0;0;0;0;
     0;0;0;0;0;0;0;0;0;0;0;0;
     0;0;0;0;0;0;0;0;F;0;0;F;
     0;0;0;0;0;0;0;0;0;0;0;0;
     0;0;0;0;0;0];
u = k\p        %输出各节点位移

U=[0;0;0;0;0;0;0;0;0;u(1:54);0;0;0;0;0;0;0;0;0];
P = KK*U       %输出节点载荷

 