function [N,dndr,dnds,dndt]=shape(x,y,z)
% 构建形函数矩阵N、形函数N对r的偏导dndr、形函数N对s的偏导dnds和形函数N对t的偏导dndt
N1=(1-x)*(1-y)*(1-z)/8;
N2=(1+x)*(1-y)*(1-z)/8;
N3=(1+x)*(1+y)*(1-z)/8;
N4=(1-x)*(1+y)*(1-z)/8;
N5=(1-x)*(1-y)*(1+z)/8;
N6=(1+x)*(1-y)*(1+z)/8;
N7=(1+x)*(1+y)*(1+z)/8;
N8=(1-x)*(1+y)*(1+z)/8;
N=[N1 0 0 N2 0 0 N3 0 0 N4 0 0 N5 0 0 N6 0 0 N7 0 0 N8 0 0
    0 N1 0 0 N2 0 0 N3 0 0 N4 0 0 N5 0 0 N6 0 0 N7 0 0 N8 0
    0 0 N1 0 0 N2 0 0 N3 0 0 N4 0 0 N5 0 0 N6 0 0 N7 0 0 N8];%形函数矩阵
dndr=[-(1-y)*(1-z)
       (1-y)*(1-z)
       (1+y)*(1-z)
      -(1+y)*(1-z)
      -(1-y)*(1+z)
       (1-y)*(1+z)
       (1+y)*(1+z)
      -(1+y)*(1+z)]/8;%形函数N对r的偏导
dnds=[-(1-x)*(1-z)
      -(1+x)*(1-z)
       (1+x)*(1-z)
       (1-x)*(1-z)
      -(1-x)*(1+z)
      -(1+x)*(1+z)
       (1+x)*(1+z)
       (1-x)*(1+z)]/8;%形函数N对s的偏导
dndt=[-(1-x)*(1-y)
      -(1+x)*(1-y)
      -(1+x)*(1+y)
      -(1-x)*(1+y)
       (1-x)*(1-y)
       (1+x)*(1-y)
       (1+x)*(1+y)
       (1-x)*(1+y)]/8;%形函数N对t的偏导